app/controllers/products_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show_user_products
    @user = User.find(params[:user_id])

SELECT "products".* FROM "products" WHERE "products"."user_id" = ?  [["user_id", 1]]
---
  def show_user_products_api
    user = params[:user_id]
    @products = Product.where(user_id: user)